# Задача 1 (Создание списка)
# Создай список fruits с тремя фруктами: "яблоко", "банан", "апельсин". Выведи его на экран.

fruits = ["яблоко", "банан", "апельсин"]
print(fruits)

# Задача 2 (Получение элементов списка)
# Дан список:
# numbers = [10, 20, 30, 40, 50]
# Выведи на экран первый и последний элементы этого списка.

numbers = [10, 20, 30, 40, 50]
print(numbers[0], numbers[-1])

# Задача 3 (Добавление элементов в список)
# Дан пустой список:
# shopping_list = []
# Добавь в него элементы "хлеб" и "молоко" (по одному), затем выведи список.

shopping_list = []
shopping_list.append("хлеб")
shopping_list.append("молоко")
print(shopping_list)

# Задача 4 (Слияние списков)
# Даны два списка:
# list1 = [1, 2, 3]
# list2 = [4, 5, 6]
# Объедини их в один список (без изменения исходных) и выведи результат.

list1 = [1, 2, 3]
list2 = [4, 5, 6]
print(list1 + list2)

# Задача 5 (Добавление элементов в конкретное место списка)
# Дан список:
# tools = ["отвёртка", "дрель", "пила"]
# Вставь слово "молоток" на вторую позицию и выведи обновлённый список.

tools = ["отвёртка", "дрель", "пила"]
tools.insert(1,"молоток")
print(tools)

# Задача 6 (Замена элементов в списке)
# Дан список:
# electronics = ["телефон", "планшет", "ноутбук", "роутер"]
# Замени элемент "планшет" на "телевизор" и выведи обновлённый список.

electronics = ["телефон", "планшет", "ноутбук", "роутер"]
electronics[1] = "телевизор"
print(electronics)

# Задача 7 (Удаление элементов из списка)
# Дан список:
# books = ["Роман", "Детектив", "Фантастика", "Учебник"]
# Удали элемент "Детектив" по значению (не по индексу) и выведи список.

books = ["Роман", "Детектив", "Фантастика", "Учебник"]
books.remove("Детектив")
print(books)

# Задача 8 (Создание списка)
# Создай список colors с пятью цветами на твой выбор
# (например: "красный", "синий" и т.д.) и выведи его.

colors = ["red","white","green","blue", "yellow"]
print(colors)

# Задача 9 (Получение элементов списка)
# Дан список:
# languages = ["Python", "Java", "C++", "JavaScript"]
# Выведи на экран второй и предпоследний элементы этого списка.

languages = ["Python", "Java", "C++", "JavaScript"]
print(languages[1],languages[-2])

# Задача 10 (Очистка списка)
# Дан список:
# temp_list = [1, 2, 3, 4, 5]
# Полностью очисти его (сделай пустым) и выведи результат.

temp_list = [1, 2, 3, 4, 5]
temp_list.clear()
print(temp_list)

# Задача 11 (Добавление элементов в список)
# Дан список:
# numbers = [10, 20, 30]
# Добавь в него числа 40 и 50 (по одному) и выведи обновлённый список.

numbers = [10, 20, 30]
numbers.append(40)
numbers.append(50)
print(numbers)

# Задача 12 (Срезы списков)
# Дан список:
# alphabet = ["a", "b", "c", "d", "e", "f", "g"]
# Выведи срез от 3-го до 5-го элемента включительно (индексы: начало и конец среза).

alphabet = ["a", "b", "c", "d", "e", "f", "g"]
print(alphabet[2:5])

# Задача 13 (Замена элементов через срезы)
# Дан список:
# data = ["яблоко", "груша", "слива", "вишня", "арбуз"]
# Замени срезом элементы "груша", "слива", "вишня" на "персик", "апельсин" и выведи список.

data = ["яблоко", "груша", "слива", "вишня", "арбуз"]
data[1:4] = "персик", "апельсин"
print(data)

shopping_list = []
shopping_list.extend (["хлеб", "яйца"])
print (shopping_list)

numbers = [10, 20, 30, 40, 50]
print (numbers[2:5])

fruits = ["яблоко", "банан", "апельсин", "киви"]
fruits.remove("банан")
print (fruits)

tools = ["отвёртка", "дрель", "пила"]
tools.insert(1,"молоток")
print(tools)

electronics = ["телефон", "планшет", "ноутбук", "роутер"]
electronics[1]="телевизор"
print(electronics)

list1 = [1, 2, 3]
list2 = [4, 5, 6]
print (list1+list2)

temp_list = [1, 2, 3, 4, 5]
temp_list.clear()
print(temp_list)

animals = ["кошка", "собака", "тигр", "жираф"]
print(animals[0],animals[-1])

letters = ["a", "b", "c", "d", "e"]
new_letters = letters[2:5]
new_letters.append("f")
print (new_letters)

data = [10, 20, 30, 40, 50]
data[1:4]=25,35
print(data)

matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
print(matrix[0],matrix[1][1])

items = ["яблоко", "банан", "яблоко", "апельсин", "яблоко"]
result = items.count("яблоко")
print(result)

list_a = [1, 2, 3]
list_b = [4, 5]
list_a.extend(list_b)
print(list_a)

original = [1, [2, 3], 4]
copy = original.copy()
copy[1] = 100
print (original,copy)

import copy
original = [10, [20, 30], 40]
deep_copy = copy.deepcopy(original)
deep_copy[1][0] = 99
deep_copy[1][1] = 99
deep_copy[0] = 100
print (original,deep_copy)